TestingTool_3-0/src/InformationRegisters/ПриложенияПротоколовВыполненияТестов/ПриложенияПротоколовВыполненияТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриложенияПротоколовВыполненияТестов</name>
  <resources>
    <name>Приложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТипФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проверка</name>
    <type>
      <types>CatalogRef.Проверки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТестируемыйКлиент</name>
    <type>
      <types>CatalogRef.ТестируемыеКлиенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТестовыйСлучай</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Шаг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>73</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/ПриложенияПротоколовВыполненияТестов/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьОформлениеОтображениеПриложения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПриложение(Команда)
	
	ОтображатьПриложение = НЕ ОтображатьПриложение;
	
	ИзменитьОформлениеОтображениеПриложения();
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьОформлениеОтображениеПриложения()
	Если ОтображатьПриложение=Истина Тогда
		Элементы.ПоказатьПриложение.Картинка=БиблиотекаКартинок.Screenshot_32х32;
		Элементы.ГруппаДополнительно.Видимость = Истина;
	Иначе
		Элементы.ПоказатьПриложение.Картинка=БиблиотекаКартинок.Screenshot_gray_32х32;
		Элементы.ГруппаДополнительно.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьПриложение=Истина Тогда
		мОтбор = новый Структура("Проверка,ТестируемыйКлиент,Тест,ТестовыйСлучай,Шаг,Номер");
		ЗаполнитьЗначенияСвойств(мОтбор,ТекущиеДанные );
		ПолеHTML = ПолучитьПриложениеИзБазы(мОтбор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПриложениеИзБазы(Источник)
	СсылкаНаКартинку = Неопределено;
	Картинка="";
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Приложение,
	|	Т.ТипФайла,
	|	Т.Размер
	|ИЗ
	|	РегистрСведений.ПриложенияПротоколовВыполненияТестов КАК Т
	|ГДЕ
	|	Т.Проверка = &Проверка
	|	И Т.ТестируемыйКлиент = &ТестируемыйКлиент
	|	И Т.Тест = &Тест
	|	И Т.ТестовыйСлучай = &ТестовыйСлучай
	|	И Т.Шаг = &Шаг
	|	И Т.Номер = &Номер";
	Запрос.УстановитьПараметр("Проверка", Источник.Проверка);
	Запрос.УстановитьПараметр("ТестируемыйКлиент", Источник.ТестируемыйКлиент);
	Запрос.УстановитьПараметр("Тест", Источник.Тест);
	Запрос.УстановитьПараметр("ТестовыйСлучай", Источник.ТестовыйСлучай);
	Запрос.УстановитьПараметр("Шаг", Источник.Шаг);
	Запрос.УстановитьПараметр("Номер", Источник.Номер);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "<html><head></head><body>"+Картинка+"</body></html>";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если ТипЗнч(Выборка.Приложение)=Тип("ХранилищеЗначения") Тогда
		СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Новый Картинка(Выборка.Приложение.Получить()),новый УникальныйИдентификатор);
		Картинка = Картинка+"<IMG style='' src='"+СсылкаНаКартинку+"'><br />";
	КонецЕсли;

	
	Возврат "<html><head></head><body>"+Картинка+"</body></html>";
КонецФункции
